// src/data/characterContentMap.jsx

const characterContentMap = {
    "01": {
        '기본 정보': (
            <>
                <p>라드리스 다몬 : 다몬가 막내.</p>
                <p>먹처럼 흑 빛이 도는 머리카락은 복슬거리는 특징이 두드러졌다.
                    새까맣고, 복슬거리는 귀가 머리위에 자리하고 있는데 그가 용맹한 (?) 흑표임을 드러내고 있다.</p>
                <p>전체적으로 분홍빛을 띄는 피부를 가졌는데, 유난히 하얀 낯 위로 푸른 빛 눈동자가 눈에 띈다.
                    눈꼬리가 높게 치켜올라간 눈매가 그의 성격을 닮아 결코 온순해 보이지 않는다.</p>
                <p>날카로운 분위기의 소년인데, 꾹 다물린 입이 주인을 닮아 경직적이다. </p>
            </>
        ),
        '프로필': (
            <>
                <p><strong>나이:</strong> 7세 </p>
                <p><strong>키 / 몸무게 </strong> 124cm / 표준 </p>
                <p><strong>성격:</strong> 예민한, 무뚝뚝한, 이성적인</p>
                <p>
                    <strong> 예민한:  </strong> 그는 빈말로도 좋은 성격은 아니다.
                    유난히 날카롭고 예민한 성정인데, 그 때문인지 친화력이 전혀 없는 편.
                    다정함과는 꽤나 거리가 멀다고 볼 수 있다.
                </p>
                <p>
                    <strong> 무뚝뚝한:  </strong> 특유의 경직되고, 극존칭적인 존댓말 때문일까.
                    그를 무심하게 보이는 요소 중 하나다.
                    다른 사람들이 그에게 어려움을 느낄지라도, 전혀 고칠 생각이 없어 보인다.
                </p>

                <p>
                    <strong> 이성적인:  </strong> 감정에 휩쓸리는 것이야말로 최고의 모독이다.
                    이성이 지배한다는 것의 정석인 그에게는 타인의 감정에 동화되어 기분이 자주 바뀌는 경우는 드물다.
                </p>
            </>
        ),
        '서브 이력': (
            <>
                <p>제 나름대로 단호한 구석이 있음. (어쩌면 아닐수도)</p>
                <p>극존칭을 사용하는 말투.</p>
                <p>좋아하는 것 앞에서는 자기도 모르게 표정이 풀리긴 한다. (평소에는 불만스런 표정이거나, 무표정이다.).</p>
            </>
        )
    },
    "02": {
        '기본 정보': (
            <>
                <p>선우 연은 흰올빼미 인수.</p>
                <p>하얀색의 긴 장발이 특징적이며, 노랑 - 분홍의 파이아이가 눈에 띈다.</p>
            </>
        ),
        '프로필': (
            <>
                <p><strong>나이:</strong> 7세</p>
                <p><strong>키 / 몸무게:</strong> 103cm / 마름</p>
                <p><strong>성격:</strong>  소심한, 낯을 가리는, 순진한</p>
                <p>
                    <strong> 상세설명:  </strong> 새로운 관계에 겁부터 먹습니다.
                    상대방에게 말을 거는 것이 서투르며 먼저 다가와 주는 이를 의지하고 잘 따릅니다.
                    장난과 거짓말에 잘 속습니다
                </p>
            </>
        ),
        '서브 이력': (
            <>
                <p>추위를 잘 타고 부드러운 담요를 좋아한다.</p>
                <p>신 것, 매운 것 전부 잘 먹는다.</p>
                <p>의외로 귀신은 믿지 않고 괴담도 무서워하지 않는다.</p>
                <p>보물 1호는 부모님이 외국에서 보내주신 오르골이다. 태엽을 감으면 동요가 흘러나온다.</p>
                <p>엄마가 머리를 빗어 주는 걸 좋아한다.</p>
                <p>손잡고 다니는 것을 좋아한다.</p>
            </>
        )
    },

    "03": {
        '기본 정보': (
            <>
                <p>라드리스 다몬 : 다몬가 막내.</p>
                <p>새까만 어둠을 연상시키는 머리카락은 조금 복슬거렸는데 주인과는 달리 자유분방해보인다 (..)
                    까맣고, 복슬거리는 동그란 귀가 머리 위에서 쫑긋, 제 존재감을 드러내고 있다.</p>
                <p>어딘가 창백하게 질린 것 같은 하얀 낯은 돌아다니기 싫어하는 그의 성정 때문이다.
                    여름날의 바다처럼 푸른 색 눈이 반짝거리고 있는 것이 눈에 띄는데, 고양이상 눈매 덕에 어딘가 서늘해보인다.
                    결코 온순한 분위기는 아니다.</p>
                <p>굳게 다물린 입, 그리고 평상시에 띈 무표정은 날카롭고, 경직된 분위기를 형성했으며 선뜻 다가가기 어려워보인다. </p>
            </>
        ),
        '프로필': (
            <>
                <p><strong>나이:</strong> 13세 </p>
                <p><strong>키 / 몸무게 </strong> 160cm / 표준 </p>
                <p><strong>성격:</strong> 무신경한 , 냉정한, 무뚝뚝한, 관대한</p>
                <p>
                    <strong> 무신경한:  </strong>  타인에 대한 관심과 이해도가 적은 탓에 누군가에게 말을 거는 일은 드물다.
                    고려하지 않는 타인의 감정은 그에게 피로로 다가올 뿐이다.
                    쉽사리 그의 선 안에 누군가 들어오게 두지 않으며, 거리를 두고자 한다.

                </p>
                <p>
                    <strong> 냉정한:  </strong>  이성적인 두뇌는 더없이 감정에 휩쓸리는 것을 싫어한다는 것이다.
                    감정이야말로 그가 가장 외면하고 있는 것.
                    평소의 무표정으로 대응하는 경우가 대부분이며, 얼굴 표정이 바뀌는 일은 드물다.
                </p>

                <p>
                    <strong> 무뚝뚝한:  </strong> 특유의 무표정, 그리고 극존칭 말투까지 그를 모두 무뚝뚝하게 만들었다.
                    살갑지도 않고 붙임성 없는 성격은 모두 빈말로도 다정해 보이진 않는다.
                </p>

                <p>
                    <strong> 관대한:  </strong> 말한다면 들어주는 바를 들어주고, 원한다면 해주는 면이 있다.
                    어딘가 물렁한 부분이 있는 것은  다정한 모든 것을 싫어하지 않았기 때문에.
                </p>
            </>
        ),
        '서브 이력': (
            <>
                <p>한번 마음 먹은 것은 행하려 하는 성격.</p>
                <p>가방 안에는 그에게 어울리지 않는, 실로 만들어진 인형이 있다. </p>
                <p>좋아하는 것은 티가 안 나더라도 나름 부드러운 태도를 보인다. </p>
                <p>밀어붙이면, 자주 휘말리는 편. (본인 의지는 아닌 듯.) </p>
                <p>완벽주의자, 약간의 결벽증을 가지고 있다.  </p>
                <p>옅은 다크서클이 눈가 아래에 자리하고 있다.  </p>
            </>
        )
    },
};

export default characterContentMap;
